In [191]:
import pandas as pd
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import csv
import scipy.stats as stats
import seaborn
from keplergl import KeplerGl

In [192]:
lat_lng_data = 'code_lat_lng.csv'

In [193]:
lat_lng_df = pd.read_csv(lat_lng_data)
lat_lng_df.head()

  airport_code     lat      lng
0          AAA -17.353 -145.510
1          AAE  36.822    7.809
2          AAH  50.823    6.187
3          AAL  57.093    9.849
4          AAO   9.429  -64.471

In [194]:
lat_lng_df.count()

airport_code    3561
lat             9299
lng             9299
dtype: int64

In [195]:
drop_lat_lng_df = lat_lng_df.dropna()

In [196]:
drop_lat_lng_df.count()

airport_code    3561
lat             3561
lng             3561
dtype: int64

In [197]:
route_code_data = 'route_code_data.csv'

In [198]:
route_df = pd.read_csv(route_code_data)
route_df.head()

  source_airport destination_airport
0            AER                 KZN
1            ASF                 KZN
2            ASF                 MRV
3            CEK                 KZN
4            CEK                 OVB

In [199]:
route_df = route_df.rename(columns={'source_airport': 'source_code', 'destination_airport': 'destination_code'})
route_df.head()

  source_code destination_code
0         AER              KZN
1         ASF              KZN
2         ASF              MRV
3         CEK              KZN
4         CEK              OVB

In [200]:
route_df.count()

source_code         67663
destination_code    67663
dtype: int64

In [201]:
source_code_data = 'source_code.csv'

In [202]:
source_df = pd.read_csv(source_code_data)
source_df.head()

  airport_code
0          AER
1          ASF
2          ASF
3          CEK
4          CEK

In [203]:
destination_code_data = 'destination_code.csv'

In [204]:
destination_df = pd.read_csv(destination_code_data)
destination_df.head()

  airport_code
0          KZN
1          KZN
2          MRV
3          KZN
4          OVB

In [205]:
source_complete = pd.merge(
    source_df, lat_lng_df, how="right", on=["airport_code", "airport_code"])

source_complete.head()

  airport_code     lat     lng
0          AER  43.446  39.947
1          AER  43.446  39.947
2          AER  43.446  39.947
3          AER  43.446  39.947
4          AER  43.446  39.947

In [206]:
source_complete = source_complete.rename(columns={'airport_code': 'source_code', 'lat': 'slat', 'lng': 'slng'})
source_complete.tail()

      source_code    slat     slng
68830         ZUD -41.906  -73.797
68831         ZUN  35.083 -108.792
68832         ZVA -19.563   45.451
68833         ZWA -14.652   49.621
68834         ZZU -11.445   34.012

In [207]:
source_complete.count()

source_code    63097
slat           68835
slng           68835
dtype: int64

In [208]:
source_complete = source_complete.dropna()
source_complete = source_complete.reset_index(drop=True)

In [209]:
source_complete.count()

source_code    63097
slat           63097
slng           63097
dtype: int64

In [210]:
source_complete.tail()

      source_code    slat     slng
63092         ZUD -41.906  -73.797
63093         ZUN  35.083 -108.792
63094         ZVA -19.563   45.451
63095         ZWA -14.652   49.621
63096         ZZU -11.445   34.012

In [211]:
source_complete.drop(source_complete.tail(48).index,inplace=True)
source_complete.tail()

      source_code    slat     slng
63044         YRF   0.000    0.000
63045         YRI  47.764  -69.585
63046         YRJ  48.520  -72.266
63047         YRM  52.430 -114.904
63048         YSC  45.438  -71.691

In [212]:
source_complete.count()

source_code    63049
slat           63049
slng           63049
dtype: int64

In [213]:
source_complete.dtypes

source_code     object
slat           float64
slng           float64
dtype: object

In [214]:
destination_complete = pd.merge(
    destination_df, lat_lng_df, how="right", on=["airport_code", "airport_code"])

destination_complete.head()

  airport_code     lat     lng
0          KZN  55.608  49.277
1          KZN  55.608  49.277
2          KZN  55.608  49.277
3          KZN  55.608  49.277
4          KZN  55.608  49.277

In [215]:
destination_complete = destination_complete.rename(columns={'airport_code': 'destination_code', 'lat': 'dlat', 'lng': 'dlng'})
destination_complete.head()

  destination_code    dlat    dlng
0              KZN  55.608  49.277
1              KZN  55.608  49.277
2              KZN  55.608  49.277
3              KZN  55.608  49.277
4              KZN  55.608  49.277

In [216]:
destination_complete.count()

destination_code    63049
dlat                68787
dlng                68787
dtype: int64

In [217]:
destination_complete = destination_complete.dropna()
destination_complete = destination_complete.reset_index(drop=True)

In [218]:
destination_complete.count()

destination_code    63049
dlat                63049
dlng                63049
dtype: int64

In [219]:
destination_complete.tail()

      destination_code    dlat     dlng
63044              ZUD -41.906  -73.797
63045              ZUN  35.083 -108.792
63046              ZVA -19.563   45.451
63047              ZWA -14.652   49.621
63048              ZZU -11.445   34.012

In [220]:
destination_complete.dtypes

destination_code     object
dlat                float64
dlng                float64
dtype: object

In [226]:
concat_df = pd.concat([source_complete, destination_complete], axis=1)
concat_df.head(100)

   source_code    slat    slng destination_code    dlat    dlng
0          AER  43.446  39.947              KZN  55.608  49.277
1          AER  43.446  39.947              KZN  55.608  49.277
2          AER  43.446  39.947              KZN  55.608  49.277
3          AER  43.446  39.947              KZN  55.608  49.277
4          AER  43.446  39.947              KZN  55.608  49.277
..         ...     ...     ...              ...     ...     ...
95         KZN  55.608  49.277              OVB   0.000   0.000
96         KZN  55.608  49.277              OVB   0.000   0.000
97         LED  59.800  30.265              OVB   0.000   0.000
98         LED  59.800  30.265              OVB   0.000   0.000
99         LED  59.800  30.265              OVB   0.000   0.000

[100 rows x 6 columns]

In [227]:
concat_df = concat_df.dropna()
concat_df = concat_df.reset_index(drop=True)

In [228]:
concat_df.count()

source_code         63049
slat                63049
slng                63049
destination_code    63049
dlat                63049
dlng                63049
dtype: int64

In [229]:
concat_df

      source_code    slat     slng destination_code    dlat     dlng
0             AER  43.446   39.947              KZN  55.608   49.277
1             AER  43.446   39.947              KZN  55.608   49.277
2             AER  43.446   39.947              KZN  55.608   49.277
3             AER  43.446   39.947              KZN  55.608   49.277
4             AER  43.446   39.947              KZN  55.608   49.277
...           ...     ...      ...              ...     ...      ...
63044         YRF   0.000    0.000              ZUD -41.906  -73.797
63045         YRI  47.764  -69.585              ZUN  35.083 -108.792
63046         YRJ  48.520  -72.266              ZVA -19.563   45.451
63047         YRM  52.430 -114.904              ZWA -14.652   49.621
63048         YSC  45.438  -71.691              ZZU -11.445   34.012

[63049 rows x 6 columns]

In [234]:
concat_df = concat_df.dropna()

In [237]:
concat_df.count()

source_code         63049
slat                63049
slng                63049
destination_code    63049
dlat                63049
dlng                63049
dtype: int64

In [244]:
concat_df.loc[(concat_df!=0.000).any(1)]

      source_code    slat     slng destination_code    dlat     dlng
0             AER  43.446   39.947              KZN  55.608   49.277
1             AER  43.446   39.947              KZN  55.608   49.277
2             AER  43.446   39.947              KZN  55.608   49.277
3             AER  43.446   39.947              KZN  55.608   49.277
4             AER  43.446   39.947              KZN  55.608   49.277
...           ...     ...      ...              ...     ...      ...
63044         YRF   0.000    0.000              ZUD -41.906  -73.797
63045         YRI  47.764  -69.585              ZUN  35.083 -108.792
63046         YRJ  48.520  -72.266              ZVA -19.563   45.451
63047         YRM  52.430 -114.904              ZWA -14.652   49.621
63048         YSC  45.438  -71.691              ZZU -11.445   34.012

[63049 rows x 6 columns]

In [245]:
concat_df.head()

  source_code    slat    slng destination_code    dlat    dlng
0         AER  43.446  39.947              KZN  55.608  49.277
1         AER  43.446  39.947              KZN  55.608  49.277
2         AER  43.446  39.947              KZN  55.608  49.277
3         AER  43.446  39.947              KZN  55.608  49.277
4         AER  43.446  39.947              KZN  55.608  49.277

In [246]:
concat_df.to_csv("lats_lngs.csv", sep=',', encoding='utf-8', index=False)